In [22]:
import numpy as np
import pandas as pd

se = pd.Series([1,2,np.nan,4])
se

0    1.0
1    2.0
2    NaN
3    4.0
dtype: float64

In [23]:
se.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [24]:
sum(se.isna())

1

In [25]:
se[0],se[1]

(1.0, 2.0)

In [26]:
type(se[0])

numpy.float64

In [27]:
indexed_se = pd.Series([1,2,np.nan,4], index = ['a','b','c','d'])
print(indexed_se)

a    1.0
b    2.0
c    NaN
d    4.0
dtype: float64

In [28]:
indexed_se['a']

1.0

In [29]:
income = {'Jan': 9500, 'Feb':6200, 'Mar':6050, 'Apr': 7000}
income_se = pd.Series(income)
print(income_se)
print(income['Jan'])

Jan    9500
Feb    6200
Mar    6050
Apr    7000
dtype: int64
9500

In [30]:
print('maximum monthly income', income_se.max())
print('average of monthly income',income_se.mean())

maximum monthly income 9500
average of monthly income 7187.5

In [31]:
month_se = pd.Series(['Jan','Feb','Mar','Apr'])
income_se = pd.Series([9500,6200,6050,7000])
expense_se = pd.Series([5040,2350,2300,4800])
df = pd.DataFrame({'month':month_se, 'income':income_se, 'expense':expense_se})
df

  month  income  expense
0   Jan    9500     5040
1   Feb    6200     2350
2   Mar    6050     2300
3   Apr    7000     4800

In [32]:
df['sales'] = df['income']-df['expense']
df

  month  income  expense  sales
0   Jan    9500     5040   4460
1   Feb    6200     2350   3850
2   Mar    6050     2300   3750
3   Apr    7000     4800   2200

In [33]:
path = 'https://github.com/dongupak/DataML/raw/main/csv/'
file = path+'vehicle_prod.csv'
df = pd.read_csv(file, index_col=0)
print(df)

         2007   2008   2009   2010   2011
China    7.71   7.95  11.96  15.84  16.33
EU      19.02  17.71  15.00  16.70  17.48
US      10.47   8.45   5.58   7.60   8.40
Japan   10.87  10.83   7.55   9.09   7.88
Korea    4.04   3.78   3.45   4.20   4.62
Mexico   2.01   2.05   1.50   2.25   2.54

In [34]:
print(df.columns)
print(df.index)

Index(['2007', '2008', '2009', '2010', '2011'], dtype='object')
Index(['China', 'EU', 'US', 'Japan', 'Korea', 'Mexico'], dtype='object')

In [35]:
df['2007']

China      7.71
EU        19.02
US        10.47
Japan     10.87
Korea      4.04
Mexico     2.01
Name: 2007, dtype: float64

In [36]:
df['total'] = df[['2007','2008','2009','2010','2011']].sum(axis=1)
print(df)

         2007   2008   2009   2010   2011  total
China    7.71   7.95  11.96  15.84  16.33  59.79
EU      19.02  17.71  15.00  16.70  17.48  85.91
US      10.47   8.45   5.58   7.60   8.40  40.50
Japan   10.87  10.83   7.55   9.09   7.88  46.22
Korea    4.04   3.78   3.45   4.20   4.62  20.09
Mexico   2.01   2.05   1.50   2.25   2.54  10.35

In [37]:
num = np.arange(10,90,10).reshape(2,4)
num

array([[10, 20, 30, 40],
       [50, 60, 70, 80]])

In [38]:
col_names  = ['a','b','c','d']
d_df = pd.DataFrame(data = num, columns = col_names)
print(df)

    a   b   c   d
0  10  20  30  40
1  50  60  70  80

In [39]:
new_df = df.drop('b',axis =1, inplace=False)
print(new_df)
print('-------------------')
print(d_df)

    a   c   d
0  10  30  40
1  50  70  80
-------------------
    a   b   c   d
0  10  20  30  40
1  50  60  70  80

In [40]:
new_df = df.drop('b',axis =1, inplace=True)
print(new_df)
print('-------------------')
print(df)

None
-------------------
    a   c   d
0  10  30  40
1  50  70  80

In [42]:
df['2009'].plot(kind='pie')

KeyError: '2009'

In [49]:
df.loc['Korea']

2007    4.04
2008    3.78
2009    3.45
2010    4.20
2011    4.62
Name: Korea, dtype: float64

In [55]:
df[0:4]['2011']

China    16.33
EU       17.48
US        8.40
Japan     7.88
Name: 2011, dtype: float64

In [56]:
df.loc['Korea','2011']

4.62

In [57]:
df[2:4]

        2007   2008  2009  2010  2011
US     10.47   8.45  5.58  7.60  8.40
Japan  10.87  10.83  7.55  9.09  7.88

In [61]:
df.iloc[:,2:4]

         2009   2010
China   11.96  15.84
EU      15.00  16.70
US       5.58   7.60
Japan    7.55   9.09
Korea    3.45   4.20
Mexico   1.50   2.25

In [131]:
path = 'https://github.com/dongupak/DataML/raw/main/csv/'
file = path+'weather.csv' #measurement of wind speed in Ulreung Island (mean temperature, max windspeed, mean windspeed)
df = pd.read_csv(file, index_col=0,encoding='CP949')
df.head(5)

            평균기온  최대풍속  평균풍속
일시
2010-08-01  28.7   8.3   3.4
2010-08-02  25.2   8.7   3.8
2010-08-03  22.1   6.3   2.9
2010-08-04  25.3   6.6   4.2
2010-08-05  27.2   9.1   5.6

In [115]:
df.columns = ['mean_temp','max_windSP','mean_windSP']
df.index.name = 'date_time'
df.tail(3)

            mean_temp  max_windSP  mean_windSP
date_time
2020-07-29       21.6         3.2          1.0
2020-07-30       22.9         9.7          2.4
2020-07-31       25.7         4.8          2.5

In [116]:
df.describe()

         mean_temp   max_windSP  mean_windSP
count  3653.000000  3649.000000  3647.000000
mean     12.942102     7.911099     3.936441
std       8.538507     3.029862     1.888473
min      -9.000000     2.000000     0.200000
25%       5.400000     5.700000     2.500000
50%      13.800000     7.600000     3.600000
75%      20.100000     9.700000     5.000000
max      31.300000    26.000000    14.900000

In [117]:
df.mean(axis=0)

mean_temp      12.942102
max_windSP      7.911099
mean_windSP     3.936441
dtype: float64

In [118]:
df[df['mean_temp']<10]['mean_temp'].count()

1409

In [119]:
df.isna().sum()

mean_temp      0
max_windSP     4
mean_windSP    6
dtype: int64

In [132]:
path = 'https://github.com/dongupak/DataML/raw/main/csv/'
file = path+'weather.csv' #measurement of wind speed in Ulreung Island (mean temperature, max windspeed, mean windspeed)
df = pd.read_csv(file, encoding='CP949')
df.columns = ['date_time','mean_temp','max_windSP','mean_windSP']

df['month'] = pd.DatetimeIndex(df['date_time']).month
monthly_mean = df.groupby('month').mean()
print(monthly_mean)

       mean_temp  max_windSP  mean_windSP
month
1       1.598387    8.158065     3.757419
2       2.136396    8.225357     3.946786
3       6.250323    8.871935     4.390291
4      11.064667    9.305017     4.622483
5      16.564194    8.548710     4.219355
6      19.616667    6.945667     3.461000
7      23.328387    7.322581     3.877419
8      24.748710    6.853226     3.596129
9      20.323667    6.896333     3.661667
10     15.383871    7.766774     3.961613
11      9.889667    8.013333     3.930667
12      3.753548    8.045484     3.817097

In [134]:
monthly_mean['mean_windSP'] >=4.0

month
1     False
2     False
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: mean_windSP, dtype: bool

In [138]:
df = pd.DataFrame({'item': ['watch','ring','ring','necklass', 'bracelet'],
                   'material': ['gold','silver','platinum','gold','silver'],
                   'price': [5000000, 20000, 3500000, 300000, 60000]})
new_df = df.pivot(index='item',columns='material',values='price')
new_df.fillna(value=0)
new_df

material       gold   platinum   silver
item
bracelet        NaN        NaN  60000.0
necklass   300000.0        NaN      NaN
ring            NaN  3500000.0  20000.0
watch     5000000.0        NaN      NaN

In [139]:
df_1 = pd.DataFrame( {'A' : ['a10', 'a11', 'a12'], 
                      'B' : ['b10', 'b11', 'b12'],
                      'C' : ['c10', 'c11', 'c12']} , 
                      index = ['A', 'B',  'C'] )

df_2 = pd.DataFrame( {'B' : ['b23', 'b24', 'b25'],
                      'C' : ['c23', 'c24', 'c25'],
                      'D' : ['d23', 'd24', 'd25']} , 
                      index = ['A', 'B',  'C'] )

In [140]:
df_3 = pd.concat( [df_1, df_2])  
print(df_3)

     A    B    C    D
A  a10  b10  c10  NaN
B  a11  b11  c11  NaN
C  a12  b12  c12  NaN
A  NaN  b23  c23  d23
B  NaN  b24  c24  d24
C  NaN  b25  c25  d25